// Code program สำหรับ ตรวจจับแก๊ส เพื่อประยุกต์ใช้ตรวจเด็กติดในรถ หรือ ผู้ทำงานในพื้นที่อับอากาศ หรือ ตรวจแก๊สรั่ว
// เริ่มต้น หากยังไม่มี Library LCD LiquidCrystal_I2C ให้ Download link ตามด้านล่าง
// https://docs.arduino.cc/software/ide-v1/tutorials/installing-libraries


//1.การเรียกใช้ Library ที่เกี่ยวข้อง

  #include <LiquidCrystal_I2C.h>  // เรียกใช้ Library "LiquidCrystal_I2C.h" เพื่อเปิดใช้ LCD Module
  #include <Wire.h> // เรียกใช้ Library "Wire.h" เพื่อใช้ สื่อสาร I2C Module


//2.กำหนดการเรียกใช้ LCD   

  LiquidCrystal_I2C lcd(0x27, 16, 2);   // Module IIC/I2C Interface บางรุ่นอาจจะใช้ 0x3f ,0x27,16,2 


//3.กำหนดค่าตัวแปร รวมถึงการกำหนดขา Input และ Output ให้กับ Controller

  int sensorValue; // กำหนดให้ตัวแปร ชื่อ SensorValue มีค่าตัวแปรเป็นค่า คงที่
  int pin3 = 3;    // กำหนดให้ตัวแปร ชื่อ pin3   ใช้ขา Digital Pin 3  (โดยต่อกับ ลำโพงขั้ว+ ส่วนลำโพงขั้ว- ต่อกับ กราวน์ (GND))
  int pin13 = 13;  // กำหนดให้ตัวแปร ชื่อ pin13  ใช้ขา Digital Pin 13 


//4.กำหนดให้การ Run Program ในครั้งแรกที่เปิดทุกครั้งใน {} หลังจากนั้นไปทำงานที่ Void loop()

void setup() {  // กำหนดค่าการ Run Program ในครั้งแรก 

  pinMode(pin3, OUTPUT);      // กำหนดให้ ตัวแปรชื่อ pin3  เป็น Output
  pinMode(pin13, OUTPUT);     // กำหนดให้ ตัวแปรชื่อ pin13 เป็น Output

  digitalWrite(pin3, HIGH);   // สั่งให้ pin3 มีค่าเป็น HIGH หรือเรียกว่า ON ให้มีไฟ ไหลผ่าน
  delay(50);                  // หน่วงเวลาไว้ 50 มิลลิเซ็ค
  digitalWrite(pin3, LOW);    // สั่งให้ pin3 มีค่าเป็น LOW หรือเรียกว่า OFF ให้ตัดไฟ 
  
  digitalWrite(pin13, LOW);   // สั่งให้ pin13 มีค่าเป็น LOW หรือเรียกว่า OFF ให้ตัดไฟ  

  lcd.init();                 // กำหนดให้เริ่มใช้ LCD ( lcd.init = lcd initialize  แปรว่าเริ่มต้นใช้ LCD)
  lcd.backlight();            // สั่งเปิด backlight  
  
  lcd.setCursor(0, 0);        // กำหนด ให้ LCD แสดงผล  คอลัมน์ที่ 0 แถวที่ 0
  lcd.print("Air Pollution"); // สั่งให้ LCD แสดงข้อความภายในเครื่องหมาย (" ") ว่า Air Pollution
  delay(2000);                // หน่วงเวลาไว้ 2000 มิลลิเซ็ค
  lcd.setCursor(7, 1);        // กำหนด ให้ LCD แสดงผล  คอลัมน์ที่ 7 แถวที่ 1
  lcd.print("       ");       // สั่งให้ LCD แสดงข้อความภายในเครื่องหมาย (" ") เป็นคำว่างๆไว้ (ไม่แสดงข้อความในตอนนี้)

  Serial.begin(9600);            // sets the serial port to 9600 สำหรับการดูค่าผ่าน Computer

  
  sensorValue = analogRead(0);   // ให้ Controller อ่านค่า input analog ทาง pin A0 เก็บไว้ในตัวแปรชื่อ sensorValue
  
  lcd.setCursor(0, 1);           // กำหนด ให้ LCD แสดงผล  คอลัมน์ที่ 0 แถวที่ 1
  lcd.print("<Prepare Sensor>"); // สั่งให้ LCD แสดงข้อความภายในเครื่องหมาย (" ") ว่า <Prepare Sensor>
  delay(30000);                  // หน่วงเวลาไว้ 30000 มิลลิเซ็ค หรือ 30 วินาที เพื่ออุ่น Sensor ให้พร้อมใช้งาน
  
  digitalWrite(pin3, HIGH);      // สั่งให้ pin3 มีค่าเป็น HIGH หรือเรียกว่า ON ให้มีไฟ ไหลผ่าน
  delay(50);                     // หน่วงเวลาไว้ 50 มิลลิเซ็ค
  digitalWrite(pin3, LOW);       // สั่งให้ pin3 มีค่าเป็น LOW หรือเรียกว่า OFF ให้ตัดไฟ
  delay(100);                    // หน่วงเวลาไว้ 100 มิลลิเซ็ค
  digitalWrite(pin3, HIGH);      // สั่งให้ pin3 มีค่าเป็น HIGH หรือเรียกว่า ON ให้มีไฟ ไหลผ่าน
  delay(50);                     // หน่วงเวลาไว้ 50 มิลลิเซ็ค
  digitalWrite(pin3, LOW);       // สั่งให้ pin3 มีค่าเป็น LOW หรือเรียกว่า OFF ให้ตัดไฟ
  delay(100);                    // หน่วงเวลาไว้ 100 มิลลิเซ็ค
}


//5.กำหนดให้การ Run Program วนซ้ำ ใน {} จนกว่าจะปิดไฟเลี้ยง Controller หรือ กด ปุ่ม Reset

void loop() {                   // กำหนดให้ทำการวนซ้ำ ภายในเครื่องหมาย {}
  
  sensorValue = analogRead(0);  // ให้ Controller อ่านค่า input analog ทาง pin A0 เก็บไว้ในตัวแปรชื่อ sensorValue
  Serial.println(sensorValue);  // แสดงค่า ที่อ่านได้จาก ตัวแปร ชือ sensorValue ออกทาง serial monitor 

  
//.......................................// ถ้า คุณภาพอากาศดี Good... // .................................................................//

  if (sensorValue < 35) {       // ถ้า.... ค่า sensor ที่อ่านได้ น้อยกว่า 35 ให้ทำงานในเครื่องหมาย {}
    lcd.setCursor(0, 0);        // กำหนด ให้ LCD แสดงผล  คอลัมน์ที่ 0 แถวที่ 0
    lcd.print("Air Detection"); // สั่งให้ LCD แสดงข้อความภายในเครื่องหมาย (" ") ว่า Air Detection
    lcd.setCursor(1, 1);        // กำหนด ให้ LCD แสดงผล  คอลัมน์ที่ 1 แถวที่ 1
    lcd.print(sensorValue);     // สั่งให้ LCD แสดง ค่า ที่ได้จาก sensor
    
    lcd.setCursor(6, 1);        // กำหนด ให้ LCD แสดงผล  คอลัมน์ที่ 6 แถวที่ 1
    lcd.print("Good...");       // สั่งให้ LCD แสดงข้อความภายในเครื่องหมาย (" ") ว่า Good...
    delay(500);                 // หน่วงเวลาไว้ 500 มิลลิเซ็ค
    
    lcd.clear();                // กำหนด ให้ LCD ยกเลิกการแสดงผล 
  }

//........................................// ถ้า คุณภาพอากาศ พอใช้ได้ Fair.. //...........................................................//

  if (sensorValue >= 35 && sensorValue < 40 ) {  // ถ้า.... ค่า sensor ที่อ่านได้ มากกว่าหรือเท่ากับ 35 และ น้อยกว่า 40 ให้ทำงานในเครื่องหมาย {}
    lcd.setCursor(0, 0);                         // กำหนด ให้ LCD แสดงผล  คอลัมน์ที่ 0 แถวที่ 0 
    lcd.print("Air Detection");                  // สั่งให้ LCD แสดงข้อความภายในเครื่องหมาย (" ") ว่า Air Detection
    lcd.setCursor(1, 1);                         // กำหนด ให้ LCD แสดงผล  คอลัมน์ที่ 1 แถวที่ 1 
    lcd.print(sensorValue);                      // สั่งให้ LCD แสดง ค่า ที่ได้จาก sensor 

    lcd.setCursor(6, 1);                         // กำหนด ให้ LCD แสดงผล  คอลัมน์ที่ 6 แถวที่ 1
    lcd.print("Fair...");                        // สั่งให้ LCD แสดงข้อความภายในเครื่องหมาย (" ") ว่า Fair...
    
    digitalWrite(pin3, HIGH);                    // สั่งให้ pin3 มีค่าเป็น HIGH หรือเรียกว่า ON ให้มีไฟ ไหลผ่าน
    delay(20);                                   // หน่วงเวลาไว้ 20 มิลลิเซ็ค
    digitalWrite(pin3, LOW);                     // สั่งให้ pin3 มีค่าเป็น LOW หรือเรียกว่า OFF ให้ตัดไฟ
    delay(3000);                                 // หน่วงเวลาไว้ 3000 มิลลิเซ็ค หรือ 3 วินาที
    lcd.clear();                                 // กำหนด ให้ LCD ยกเลิกการแสดงผล 
  }


//........................................// ถ้า คุณภาพอากาศ อันตรายต่อสิ่งมีชีวิต Danger... //.................................................//
 
  if (sensorValue >= 40 && sensorValue < 100 ) { // ถ้า.... ค่า sensor ที่อ่านได้ มากกว่าหรือเท่ากับ 40 และ น้อยกว่า 100 ให้ทำงานในเครื่องหมาย {}
    lcd.setCursor(0, 0);                         // กำหนด ให้ LCD แสดงผล  คอลัมน์ที่ 0 แถวที่ 0
    lcd.print("Air Detection");                  // สั่งให้ LCD แสดงข้อความภายในเครื่องหมาย (" ") ว่า Air Detection
    lcd.setCursor(1, 1);                         // กำหนด ให้ LCD แสดงผล  คอลัมน์ที่ 1 แถวที่ 1
    lcd.print(sensorValue);                      // สั่งให้ LCD แสดง ค่า ที่ได้จาก sensor 

    lcd.setCursor(6, 1);                         // กำหนด ให้ LCD แสดงผล  คอลัมน์ที่ 6 แถวที่ 1
    lcd.print("Danger...");                      // สั่งให้ LCD แสดงข้อความภายในเครื่องหมาย (" ") ว่า Danger...
    
    digitalWrite(pin3, HIGH);                    // สั่งให้ pin3 มีค่าเป็น HIGH หรือเรียกว่า ON ให้มีไฟ ไหลผ่าน
    delay(50);                                   // หน่วงเวลาไว้ 50 มิลลิเซ็ค
    digitalWrite(pin3, LOW);                     // สั่งให้ pin3 มีค่าเป็น LOW หรือเรียกว่า OFF ให้ตัดไฟ
    lcd.clear();                                 // กำหนด ให้ LCD ยกเลิกการแสดงผล 
  }



//........................................// ถ้า คุณภาพอากาศ อันตรายต่อสิ่งมีชีวิตมากๆๆ Very Danger... //.......................................//
  
  if (sensorValue >= 100 ) {                    // ถ้า.... ค่า sensor ที่อ่านได้ มากกว่าหรือเท่ากับ 100 ให้ทำงานในเครื่องหมาย {}
    lcd.setCursor(0, 0);                        // กำหนด ให้ LCD แสดงผล  คอลัมน์ที่ 0 แถวที่ 0
    lcd.print("Air Detection");                 // สั่งให้ LCD แสดงข้อความภายในเครื่องหมาย (" ") ว่า Air Detection
    lcd.setCursor(1, 1);                        // กำหนด ให้ LCD แสดงผล  คอลัมน์ที่ 1 แถวที่ 1
    lcd.print(sensorValue);                     // สั่งให้ LCD แสดง ค่า ที่ได้จาก sensor 

    lcd.setCursor(5, 1);                        // กำหนด ให้ LCD แสดงผล  คอลัมน์ที่ 5 แถวที่ 1
    lcd.print("Very Danger");                   // สั่งให้ LCD แสดงข้อความภายในเครื่องหมาย (" ") ว่า Very Danger

    
    digitalWrite(pin3, HIGH);                    // สั่งให้ pin3 มีค่าเป็น HIGH หรือเรียกว่า ON ให้มีไฟ ไหลผ่าน
    delay(2000);                                 // หน่วงเวลาไว้ 2000 มิลลิเซ็ค หรือ 2 วินาที
    digitalWrite(pin3, LOW);                     // สั่งให้ pin3 มีค่าเป็น LOW หรือเรียกว่า OFF ให้ตัดไฟ
    lcd.clear();                                 // กำหนด ให้ LCD ยกเลิกการแสดงผล 
    //lcd.clear();                                   
  }


//.......................................// ถ้าไม่ตรงตาม if ข้างบน ให้ทำตาม else {} //........................................................//

  else {
    digitalWrite(pin13, LOW);                    //  สั่งให้ pin13 มีค่าเป็น LOW หรือเรียกว่า OFF ให้ตัดไฟ
  }

//......................................// หลังจากทำซ้ำ if/else แล้ว ให้ หน่วงเวลา 1 มิลลิเซ็ค เพื่อกลับไป เริ่มต้นรอบใหม่ //...................................................// 
  delay(1);                                      // หน่วงเวลาไว้ 1 มิลลิเซ็ค 
}
